app/views/events/show.html.erb

SELECT "categories".* FROM "categories"
SELECT "categories".id FROM "categories" INNER JOIN "categories_events" ON "categories"."id" = "categories_events"."category_id" WHERE "categories_events"."event_id" = ?  [["event_id", 1]]
---
        <!-- ########## icones dos eventos ############-->
        <% @categoriasDetalhes =  Category.all%>
          <% @event.category_ids.each do |item| %>