app/controllers/comments_controller.rb

INSERT INTO "comments" ("conteudo", "event_id", "user_id", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["conteudo", "Teste\r\n"], ["event_id", 2], ["user_id", 4], ["data", "2015-08-24 13:50:40.825315"], ["created_at", "2015-08-24 13:50:40.827930"], ["updated_at", "2015-08-24 13:50:40.827930"]]
---
  def create
    @comment = current_user.comments.build(comment_params)
    @comment.data = DateTime.now;
    current_user.point_of_comment
    respond_to do |format|
      if @comment.save