app/controllers/events_controller.rb

  def index
    @event = Event.new
    @events = Event.ativos.order(eu_vou_rating: :desc)
---
SELECT "events".* FROM "events" WHERE (data >= '2015-08-03 13:04:35.669032')  ORDER BY "events"."eu_vou_rating" DESC

  def create
    @event = Event.new(event_params)
    @event.creator = current_user
    current_user.point_for_create_event

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("titulo", "descricao", "endereco", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "data", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "events"."id" = ?